ronn-cn/SharkSmart/SharkSmart/bin/Debug/Library/Components/STM32F429IG-S/Project/Config/ETH/src/eth_upgrade.c
#include "eth_upgrade.h"
#include "lwip_comm.h"
#include "log.h"
#include "rtos.h"
#include "lwip/api.h"
#include "lwip/lwip_sys.h"
#include "lwip/ip.h"
#include "string.h"
#include "malloc.h"
#include "lwip/sockets.h"
#include "lwip/inet.h"
#include "lwip/netdb.h"
#include "exfuns.h"
#include "ff.h"
#include "eth_user.h"
#include "config.h"
#include "gpio.h"
#include "esp8266.h"
#include "m2_interface.h"
#include "stdlib.h"

struct http_message_app_info_t message_app_info;
struct http_message_resources_info_t message_resources_info;
struct http_url_info_t URL_LIST[URL_CHOOSE_MAX];
uint32_t loacl_version = 0;

uint8_t find_app_message(char * str, struct http_message_app_info_t *message)
{
    uint8_t res = 0;
    char * message_str = str;
    if((res = sscanf((char *)message_str, "{\"instance\":\"%[^\"]\",\"time\":\"%[^\"]\",\"hard_v\":\"%[^\"]\",\"soft_v\":\"%[^\"]\",\"path\":\"%[^\"]\",\"files\":\"[%[^\]]]\",\"force\":\"%[^\"]\"}", \
    message->instance_buf, \
    message->time_buf,\
    message->hard_v_buf,\
    message->soft_v_buf,\
    message->path_buf, \
    message->file_buf, \
    message->force_buf)) != 7)
    {
        LOG(LEVEL_INFO, "find_app_message res %d\n", res);
        return 1;
    }
    return 0;
}
uint8_t find_resources_message(char * str, struct http_message_resources_info_t *message)
{
    uint8_t res = 0;
    uint8_t find_pos = 0;

    char * message_str = str;
    if((res = sscanf((char *)message_str, "{\"instance\":\"%[^\"]\",\"time\":\"%[^\"]\",\"hard_v\":\"%[^\"]\",\"resource_v\":\"%[^\"]\",\"path\":\"%[^\"]\",\"files\":\"%[^\"]\",\"reboot\":\"%[^\"]\"}", \
    message->instance_buf, \
    message->time_buf,\
    message->hard_v_buf,\
    message->resource_v_buf,\
    message->path_buf, \
    message->files_buf, \
    message->reboot_buf)) != 7)
    {
        LOG(LEVEL_INFO, "find_app_message res %d\n", res);
        return 1;
    }


    for(uint8_t i = 0; i < strlen(message->files_buf); i++)
    {
        if(message->files_buf[i] == '&')
        {
            memcpy(message->file_buf[message->files_cnt], message->files_buf + find_pos + 1, i - find_pos - 2);

            find_pos = i + 1;
            message->files_cnt++;
        }
    }
    memcpy(message->file_buf[message->files_cnt], message->files_buf + find_pos + 1, strlen(message->files_buf) - find_pos - 2);
    message->files_cnt++;

    return 0;
}


FRESULT scan_files_need(char *path, struct http_message_resources_info_t *message)
{
	FRESULT res; //定义结果对象
	DIR dir; //定义目录对象
	static FILINFO fno; //定义静态文件信息结构对象
	res = f_opendir(&dir,path); //打开目录，返回状态 和 目录对象的指针
	if(res == FR_OK) //打开成功
	{
		while(1)
		{
			res = f_readdir(&dir, &fno); //读取目录，返回状态 和 文件信息的指针
			if(res != FR_OK || fno.fname[0] == 0) break; //若打开失败 或 到结尾，则退出
			if(!(fno.fattrib & AM_DIR))
            {
				//LOG(LEVEL_INFO, "File:%s/%s",path,fno.fname); //是文件
				//strcpy(pathBuff, fno.fname); //将文件目录存储起来
                for(uint8_t i = 0; i < message->files_cnt; i++)
                {
                    if(strcmp(message->file_buf[i], fno.fname) == 0)
                    {
                        for(uint8_t j = i; j < message->files_cnt - 1; j++)
                        {
                            memset(message->file_buf[j], 0, sizeof(message->file_buf[j]));
                            strcpy(message->file_buf[j], message->file_buf[j + 1]);
                        }
                        message->files_cnt--;
                        break;
                    }
                }

			}
		}
	}
	else
	{
		LOG(LEVEL_INFO, "Fail - %s",&res); //打开失败
	}
	f_closedir(&dir); //关闭目录
	return res; //返回状态
}

uint8_t change_url_choose(uint8_t url_now, uint8_t max)
{
    uint8_t res;
    res = url_now + 1;
    if(res >= max)
    {
        res = 0;
    }
    return res;
}

uint8_t find_version(void)
{
    uint32_t  cpu_sr;
    uint8_t res = 0;
    FIL file_fd;
    uint8_t file_res;
    char read_buf[100];
    UINT read_len = 0; 
    int resource_version = 0;

    if(message_resources_info.files_cnt > 0)
    {
        OS_ENTER_CRITICAL();

        file_res = f_open(&file_fd, (TCHAR*)"0:/System/version_info.txt", FA_READ);
        if(file_res == FR_OK)
        {
            f_read(&file_fd, read_buf, sizeof(read_buf), &read_len);
            if(read_len > 0)
            {
                if(sscanf(read_buf, "resource:%03d\r\n", &resource_version) != 1)
                {
                    resource_version = 0;
                }
                else
                {
                    LOG(LEVEL_INFO, "Local Resource Version is %03d\n", resource_version);
                }
            }
            if(resource_version >= atoi(message_resources_info.resource_v_buf)) //????????
            {
                scan_files_need("0:/Resources", &message_resources_info);
            }
            //LOG(LEVEL_INFO, "\n\n%s\n%s\n%s\n%s\n%d\n", 
                // message_resources_info.path_buf, 
                // message_resources_info.file_buf[0], 
                // message_resources_info.file_buf[1], 
                // message_resources_info.file_buf[2], 
                // message_resources_info.files_cnt);
        }else{
            
            res = 1;
        }

        f_close(&file_fd);
        OS_EXIT_CRITICAL();
    }
    // if(strcmp(http_message_info.instance_buf, FILE_INSTANCE_NAME) != 0)
    // {
    //     LOG(LEVEL_INFO, "Instance fail\n");
    //     goto FILES_MESSAGE_FAIL;
    // }
    Config_Read(FIRMWARE_VERSION_ADDR,&loacl_version,FIRMWARE_VERSION_SIZE);
    if(loacl_version == 0xFFFFFFFF)
        loacl_version = 0;
    LOG(LEVEL_INFO, "\nLocal app version %d\n", loacl_version);

    return res;
}

void add_app_upgrade_file(char *file_app_upgrade_data)
{
    uint32_t  cpu_sr;
    FIL file_fd;
    int file_res;
    char file_url[30];
    UINT file_bw;
    
    if(file_app_upgrade_data == NULL)
    {
        return;
    }
    memset(file_url, 0, sizeof(file_url));
    
    strcpy(file_url, "0:/");
    strcpy(file_url + strlen(file_url), message_app_info.file_buf);

    
    OS_ENTER_CRITICAL();

    file_res = f_open(&file_fd, (TCHAR*)file_url, FA_READ|FA_WRITE|FA_CREATE_ALWAYS);
    LOG(LEVEL_INFO, "File f_open res %d\n", file_res);
    LOG(LEVEL_INFO, "%s\n", file_url);
    if(file_res == 0)
    {
        file_res = f_write(&file_fd, file_app_upgrade_data, message_app_info.file_length, &file_bw);
    }
    LOG(LEVEL_INFO, "APP File write res %d, %d, \n", file_res, file_bw);
    
    message_app_info.recv_ok_flag = 1;

    f_close(&file_fd);
    OS_EXIT_CRITICAL();
    
