ronn-cn/SharkSmart/SharkSmart/bin/Debug/Library/Components/STM32F429IG-S/Project/Config/ETH/src/eth_upgrade.c
}

void add_resource_file(uint8_t resources_file_cnt)
{
    uint32_t  cpu_sr;
    FIL file_fd;
    int file_res;
    char file_url[30];
    UINT file_bw;
    
    memset(file_url, 0, sizeof(file_url));
    strcpy(file_url, "0:/Resources/");
    strcpy(file_url + strlen(file_url), message_resources_info.file_buf[resources_file_cnt - 1]);
    
    OS_ENTER_CRITICAL();
    f_mkdir("0:/Resources");
    file_res = f_open(&file_fd, (TCHAR*)file_url, FA_READ|FA_WRITE|FA_CREATE_ALWAYS);
    LOG(LEVEL_INFO, "File f_open res %d\n", file_res);
    LOG(LEVEL_INFO, "%s\n", file_url);
    if(file_res == 0)
    {
        file_res = f_write(&file_fd, \
                            message_resources_info.save_buf_p[resources_file_cnt - 1], \
                            message_resources_info.file_length[resources_file_cnt - 1], \
                            &file_bw);

    }
    LOG(LEVEL_INFO, "APP File write res %d, %d, \n", file_res, file_bw);
    
    f_close(&file_fd);

    if(resources_file_cnt == 1)
    {
        message_resources_info.recv_ok_flag = 1;

        file_res = f_open(&file_fd, (TCHAR*)"0:/System/version_info.txt", FA_READ|FA_WRITE|FA_CREATE_ALWAYS);
        f_printf(&file_fd, "resource:%s\r\n", message_resources_info.resource_v_buf);
        f_close(&file_fd);
    }
    OS_EXIT_CRITICAL();
}

//升级文件路径处理
uint8_t EV_Add_Updata_Info_Manage(char *Path,char *f_Name,uint16_t Port)
{
    if(Path == NULL || f_Name == NULL)
    {
        return 1;
    }
    uint8_t url_cnt;
    char f_host_name[20];
    char f_url1_1[50];
  
    if(strstr(Path,"www") == NULL)
    {
        LOG(LEVEL_INFO,"file path err!!!\n");
        return 2;
    }
    
    sscanf(Path,"%[^/]%s",f_host_name,f_url1_1);
    LOG(LEVEL_INFO,"%s\n%s\n",f_host_name,f_url1_1);
    for(url_cnt=0;url_cnt<URL_CHOOSE_MAX;url_cnt++)
    {
        if(URL_LIST[url_cnt].sta == 0)
        {
            break;
        }else{
            if(strcmp(URL_LIST[url_cnt].host_name,f_host_name) == 0)
            {
                return 3;  
            }    
        }
    }

    if(url_cnt >=URL_CHOOSE_MAX)
    {
        LOG(LEVEL_INFO,"URL_LIST FULL\n");
        return 4;
    }
    memset(URL_LIST[url_cnt].host_name, 0, sizeof(URL_LIST[url_cnt].host_name));
    memset(URL_LIST[url_cnt].url_1, 0, sizeof(URL_LIST[url_cnt].url_1));
    memset(URL_LIST[url_cnt].url_2, 0, sizeof(URL_LIST[url_cnt].url_2));
    memset(URL_LIST[url_cnt].url_3, 0, sizeof(URL_LIST[url_cnt].url_3));
    memset(URL_LIST[url_cnt].url_4, 0, sizeof(URL_LIST[url_cnt].url_4));
    
    URL_LIST[url_cnt].sta = 1;
    URL_LIST[url_cnt].port = Port;
    strcpy(URL_LIST[url_cnt].host_name,f_host_name);
    sprintf(URL_LIST[url_cnt].url_1,"GET %s",f_url1_1);
    sprintf(URL_LIST[url_cnt].url_2,"/%s",f_Name);
    sprintf(URL_LIST[url_cnt].url_3," HTTP/1.1\r\n");
    sprintf(URL_LIST[url_cnt].url_4,"Host: %s\r\n\r\n",f_host_name);

    return 0;
}


/***************************************************************************************************/
/********************************************lwip_upgrade*******************************************/
/***************************************************************************************************/
#define LWIP_UPGRADE_PRIO		LWIP_UPGRADE_PRIO_NUM
#define LWIP_UPGRADE_STK_SIZE	3000
uint32_t *LWIP_UPGRADE_TASK_STK;

void lwip_upgarde_thread(void *arg)
{
    while(dhcpstatus != 2)
    {
        OSTimeDly(10);
    }

    OSTimeDly(100);
    

	struct hostent *link_host;
    struct in_addr link_ipaddr;
    struct sockaddr_in link_sockaddr;
	int sock_fd;
    int timeout = 500;
    int res;
    
    
    int recv_len = 0;
    char *send_buf_p;
    char *recv_buf_p;
	char *save_file_buf_p = NULL;
    
    send_buf_p = mymalloc(SRAMEX, HTTP_BUF_MAX);
    recv_buf_p = mymalloc(SRAMEX, HTTP_BUF_MAX);
    
    char *message_start_p;
    uint8_t url_choose = 0;
    while(1)
    {
        LOG(LEVEL_INFO,"\n******* URL %d *******\n",url_choose);
      
        if((link_host = gethostbyname(URL_LIST[url_choose].host_name)) == NULL)
        {
            url_choose = change_url_choose(url_choose, URL_CHOOSE_MAX);
            continue;
        }
        link_ipaddr.s_addr = *(uint32_t *)link_host->h_addr_list[0];
        link_sockaddr.sin_family = AF_INET;
        link_sockaddr.sin_port = htons(URL_LIST[url_choose].port);
        link_sockaddr.sin_addr = link_ipaddr;

        memset(&(link_sockaddr.sin_zero), 0, sizeof(link_sockaddr.sin_zero));

        if((sock_fd = socket(AF_INET, SOCK_STREAM, 0)) < 0)
        {
            goto LWIP_SOCKET_FAIL;
        }
        
        setsockopt(sock_fd, SOL_SOCKET, SO_RCVTIMEO, &timeout,sizeof(timeout));
        
        if(connect(sock_fd, (struct sockaddr *)&link_sockaddr, sizeof(struct sockaddr)) == -1)
        {
            LOG(LEVEL_INFO, "Connect fail!\n");
            url_choose = change_url_choose(url_choose, URL_CHOOSE_MAX);
            goto LWIP_CONNECT_FAIL;
        }
        LOG(LEVEL_INFO, "Connect Success!\n");
       
        memset(send_buf_p, 0, HTTP_BUF_MAX);
        strcpy(send_buf_p, URL_LIST[url_choose].url_1);
        strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_2);
        strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_3);
        strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_4);
    
        //LOG(LEVEL_INFO, "Send %s\n", send_buf_p);
        if((res = send(sock_fd, send_buf_p, strlen((char *)send_buf_p), 0)) < 0)
        {
            LOG(LEVEL_INFO, "Res(%d)\n", res);
            LOG(LEVEL_INFO, "Send Fail\n");
            goto LWIP_FILES_MESSAGE_FAIL;
        }

        //LOG(LEVEL_INFO, "Res(%d)\n", res);
        OSTimeDly(1000);
        uint8_t message_recv_cnt = 0;
        while(1)
        {
            memset(recv_buf_p, 0, HTTP_BUF_MAX);
            recv_len = recv(sock_fd, recv_buf_p, HTTP_BUF_MAX, 0);
            if(recv_len > 0)
            {
                message_recv_cnt = 0;
                //LOG(LEVEL_INFO, "Recv(%d):%s\n", recv_len, recv_buf_p);
                message_start_p = strstr((char *)recv_buf_p, "{\"instance\":");
                
                if(message_start_p != NULL)
                {
                    //LOG(LEVEL_INFO, "\nMessage: %s\n", message_start_p);
                }
                else
                {
                    LOG(LEVEL_INFO, "Recv Message fail!\n");
                    goto LWIP_FILES_MESSAGE_FAIL;
                }
                
                memset(&message_app_info, 0, sizeof(message_app_info));
                
                if(find_app_message(message_start_p, &message_app_info) != 0)
                {
                    LOG(LEVEL_INFO, "FILES_MESSAGE_FAIL!\n");
                    goto LWIP_FILES_MESSAGE_FAIL;
                }
                //LOG(LEVEL_INFO, "\n\n%s\n%s\n%s\n%s\n", 
                // message_app_info.instance_buf, 
                // message_app_info.time_buf,
                // message_app_info.file_buf, 
                // message_app_info.force_buf);

                memset(&message_resources_info, 0, sizeof(message_resources_info));
                message_start_p = strstr(message_start_p, "\n");
                if(message_start_p != NULL)
                {
                    message_start_p += 1;
                    //LOG(LEVEL_INFO, "\nRes Message: %s\n", message_start_p);
                }
                else
                {
                    goto LWIP_FILES_MESSAGE_FAIL;
                }

                if(find_resources_message(message_start_p, &message_resources_info) != 0)
                {
                    LOG(LEVEL_INFO, "Resource FILES_MESSAGE_FAIL!\n");
                    //goto LWIP_FILES_MESSAGE_FAIL;
                }
                else
                {
                    //LOG(LEVEL_INFO, "\n\n%s\n%s\n%s\n%s\n%d\n", 
                        // message_resources_info.path_buf, 
                        // message_resources_info.file_buf[0], 
                        // message_resources_info.file_buf[1], 
                        // message_resources_info.file_buf[2], 
                        // message_resources_info.files_cnt);
                }
               
                find_version();
                break;
            }
            else
            {
                OSTimeDly(2000);
                if(message_recv_cnt ++ > 5)
                {
                    LOG(LEVEL_INFO, "Message no recv data.\n");
                    goto LWIP_FILES_MESSAGE_FAIL;
                }
            }
        }
        if(loacl_version < atoi(message_app_info.soft_v_buf))
        {
            memset(send_buf_p, 0, HTTP_BUF_MAX);
            
            strcpy(send_buf_p, URL_LIST[url_choose].url_1);
            strcpy(send_buf_p + strlen(send_buf_p), message_app_info.path_buf);
            strcpy(send_buf_p + strlen(send_buf_p), message_app_info.file_buf);
            strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_3);
            strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_4);
            //LOG(LEVEL_INFO, "URL:%s\n", send_buf_p);
            send(sock_fd, send_buf_p, strlen((char *)send_buf_p), 0);
            
            uint32_t recv_cnt = 0;
            char *buf_temp_p;
            
            uint8_t recv_err_cnt = 0;
            while(1)
            {
                memset(recv_buf_p, 0, HTTP_BUF_MAX);
                recv_len = recv(sock_fd, recv_buf_p, HTTP_BUF_MAX, 0);
                if(recv_len > 0)
                {
                    buf_temp_p = strstr(recv_buf_p, "\r\n\r\n");
                    recv_cnt += recv_len - (buf_temp_p - recv_buf_p + 4);
                    
                    buf_temp_p = strstr(recv_buf_p, "Content-Length: ");
                    if(buf_temp_p == NULL)
                    {
                        LOG(LEVEL_INFO,"File recv data err\n");
                        goto LWIP_APP_FILE_RECV_FAIL;
                    }
                    sscanf(buf_temp_p, "Content-Length: %d\r\n%*s", &(message_app_info.file_length));
                    
                    LOG(LEVEL_INFO, "Need Recv Length:%d\n", message_app_info.file_length);
                    
                    save_file_buf_p = mymalloc(SRAMEX, message_app_info.file_length);
                    
                    memcpy(save_file_buf_p, recv_buf_p + recv_len - recv_cnt, recv_cnt);
                    
                    break;
                }
                else
                {
                    OSTimeDly(1000);
                    if(recv_err_cnt++ > 5)
                    {
                        LOG(LEVEL_INFO, "File recv fail\n");
                        goto LWIP_APP_FILE_RECV_FAIL;
                    }
                }
            }
            
            recv_err_cnt = 0;
            while(1)
            {
                memset(recv_buf_p, 0, HTTP_BUF_MAX);
                recv_len = recv(sock_fd, recv_buf_p, HTTP_BUF_MAX, 0);
                if(recv_len >= 0)
                {
                    memcpy(save_file_buf_p + recv_cnt, recv_buf_p, recv_len);
                    recv_cnt += recv_len;
                    recv_err_cnt = 0;
                }
                else
                {
                    if(recv_cnt >= message_app_info.file_length)
                    {
                        //LOG(LEVEL_INFO, "File recv %d\n", recv_cnt);
                        LOG(LEVEL_INFO, "File recv success!\n");
                        break;
                    }
                    else
                    {
                        OSTimeDly(1000);
                        if(recv_err_cnt++ > 5)
                        {
                            //LOG(LEVEL_INFO, "File recv %d\n", recv_cnt);
                            LOG(LEVEL_INFO, "File recv fail!\n");
                            goto LWIP_APP_FILE_RECV_FAIL;
                        }
                        
