ronn-cn/SharkSmart/SharkSmart/bin/Debug/Library/Components/STM32F429IG-S/Project/Config/ETH/src/eth_upgrade.c
                    }
                }
                OSTimeDly(5);
            }
            if(strcmp(message_app_info.force_buf, "1") == 0)
            {
                if(1)
                if(recv_cnt == message_app_info.file_length)
                {
                    LOG(LEVEL_INFO, "ALL recv OK!\n");
                    add_app_upgrade_file(save_file_buf_p);           //app文件添加
                } 
            }
            OSTimeDly(1000);
        }

LWIP_APP_FILE_RECV_FAIL:
        OSTimeDly(1000);

/*********************************************resource**********************************************/
        uint8_t resources_file_cnt = message_resources_info.files_cnt;
        while(resources_file_cnt > 0)
        {
            memset(send_buf_p, 0, HTTP_BUF_MAX);
            strcpy(send_buf_p, URL_LIST[url_choose].url_1);
            strcpy(send_buf_p + strlen(send_buf_p), message_resources_info.path_buf);
            strcpy(send_buf_p + strlen(send_buf_p), message_resources_info.file_buf[resources_file_cnt - 1]);
            strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_3);
            strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_4);
            LOG(LEVEL_INFO, "URL:%s\n", send_buf_p);
            send(sock_fd, send_buf_p, strlen((char *)send_buf_p), 0);
            
            uint32_t recv_cnt = 0;
            char *buf_temp_p;
            
            uint8_t recv_err_cnt = 0;
            while(1)
            {
                memset(recv_buf_p, 0, HTTP_BUF_MAX);
                recv_len = recv(sock_fd, recv_buf_p, HTTP_BUF_MAX, 0);
                if(recv_len > 0)
                {
                    buf_temp_p = strstr(recv_buf_p, "\r\n\r\n");
                    recv_cnt += recv_len - (buf_temp_p - recv_buf_p + 4);
                    
                    buf_temp_p = strstr(recv_buf_p, "Content-Length: ");
                    if(buf_temp_p == NULL)
                    {
                        LOG(LEVEL_INFO,"File recv data err\n");
                        goto LWIP_RES_FILE_RECV_FAIL;
                    }
                    sscanf(buf_temp_p, "Content-Length: %d\r\n%*s", &(message_resources_info.file_length[resources_file_cnt - 1]));
                    LOG(LEVEL_INFO, "Need Recv Length:%d\n", message_resources_info.file_length[resources_file_cnt - 1]);
                    message_resources_info.save_buf_p[resources_file_cnt - 1] = mymalloc(SRAMEX, message_resources_info.file_length[resources_file_cnt - 1]);
                    memcpy(message_resources_info.save_buf_p[resources_file_cnt - 1], recv_buf_p + recv_len - recv_cnt, recv_cnt);
                    break;
                }
                else
                {
                    OSTimeDly(1000);
                    if(recv_err_cnt++ > 5)
                    {
                        LOG(LEVEL_INFO, "File recv fail\n");
                        goto LWIP_RES_FILE_RECV_FAIL;
                    }
                }
            }
            
            recv_err_cnt = 0;
            while(1)
            {
                memset(recv_buf_p, 0, HTTP_BUF_MAX);
                recv_len = recv(sock_fd, recv_buf_p, HTTP_BUF_MAX, 0);
                if(recv_len >= 0)
                {
                    memcpy(message_resources_info.save_buf_p[resources_file_cnt - 1] + recv_cnt, recv_buf_p, recv_len);
                    recv_cnt += recv_len;
                }
                else
                {
                    if(recv_cnt >= message_resources_info.file_length[resources_file_cnt - 1])
                    {
                        LOG(LEVEL_INFO, "File recv success!\n");
                        break;
                    }
                    else
                    {
                        OSTimeDly(1000);
                        if(recv_err_cnt++ > 5)
                        {
                            LOG(LEVEL_INFO, "File recv fail!\n");
                            goto LWIP_RES_FILE_RECV_FAIL;
                        }
                    }
                }
                OSTimeDly(5);
            }
            if(1)
            {
                if(1)
                if(recv_cnt == message_resources_info.file_length[resources_file_cnt - 1])
                {
                    LOG(LEVEL_INFO, "ALL recv OK!\n");
                    add_resource_file(resources_file_cnt);        //添加缺少的资源文件
                }
                
            }
            resources_file_cnt--;
        }

LWIP_RES_FILE_RECV_FAIL:
        OSTimeDly(1000);
    
        myfree(SRAMEX, save_file_buf_p);

        myfree(SRAMEX, message_resources_info.save_buf_p[0]);
        myfree(SRAMEX, message_resources_info.save_buf_p[1]);
        myfree(SRAMEX, message_resources_info.save_buf_p[2]);
        myfree(SRAMEX, message_resources_info.save_buf_p[3]);
        myfree(SRAMEX, message_resources_info.save_buf_p[4]);
        myfree(SRAMEX, message_resources_info.save_buf_p[5]);
        myfree(SRAMEX, message_resources_info.save_buf_p[6]);
        myfree(SRAMEX, message_resources_info.save_buf_p[7]);
        myfree(SRAMEX, message_resources_info.save_buf_p[8]);
        myfree(SRAMEX, message_resources_info.save_buf_p[9]);


        if(strcmp(message_app_info.force_buf, "1") == 0  
           || strcmp(message_resources_info.reboot_buf, "1") == 0)
            {
                if(message_resources_info.recv_ok_flag == 1  
                || message_app_info.recv_ok_flag == 1)
                {
                    LOG(LEVEL_INFO, "System restart!\n");
                    HAL_NVIC_SystemReset();
                }

            }

        OSTimeDly(10000);
    
LWIP_FILES_MESSAGE_FAIL:
        OSTimeDly(2000);
      
LWIP_CONNECT_FAIL:
        OSTimeDly(100000);

LWIP_SOCKET_FAIL:
        LOG(LEVEL_INFO, "Close socket!\n");
        close(sock_fd);
        OSTimeDly(10000);
    }
}

/***************************************************************************************************/
/********************************************wifi_upgrade*******************************************/
/***************************************************************************************************/


