ronn-cn/SharkSmart/SharkSmart/bin/Debug/Library/Components/STM32F429IG-S/Project/Config/ETH/src/eth_upgrade.c
//透传数据指针
extern uint8_t *transparent_rx_buf_cnt;             //当前指针
extern uint8_t *transparent_rx_buf_last;            //末尾指针
extern uint8_t *transparent_rx_buf;                 //接收缓冲区指针

#define WIFI_TASK_UPDATE_PRIO  WIFI_TASK_UPDATE_PRIO_NUM
#define WIFI_STK_UPDATE_SIZE   3000 
uint32_t *WIFI_TASK_UPDATE_STK; 
void wifi_update_task(void *pdata)
{
    while(g_net_user_sta != WIFI_NETWORK)
    {
        OSTimeDly(1000);
    }
    int recv_len = 0;
    char *send_buf_p;
    char *recv_buf_p;
	char *save_file_buf_p = NULL;
    uint8_t *transparent_recv_old;     //数据接收位置指针
    uint8_t *transparent_recv_new;
    
    send_buf_p = mymalloc(SRAMEX, HTTP_BUF_MAX);
    recv_buf_p = mymalloc(SRAMEX, HTTP_BUF_MAX);

    char *message_start_p;

    char TCP_IP[20] = {0};
    uint8_t url_choose = 0;
    while(1)
    {
        LOG(LEVEL_INFO,"\n******* URL %d *******\n",url_choose);

        if(wifi_tcp_DNS(URL_LIST[url_choose].host_name,TCP_IP) != 0)
        {
            url_choose = change_url_choose(url_choose, URL_CHOOSE_MAX);
            continue;
        }
        OSTimeDly(1000);
        wifi_tcp_connect(TCP_IP,URL_LIST[url_choose].port);             
    
        memset(send_buf_p, 0, HTTP_BUF_MAX);
        strcpy(send_buf_p, URL_LIST[url_choose].url_1);
        strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_2);
        strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_3);
        strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_4);

        wifi_tcp_recving_sta = 1;           //tcp 接受中（防止普通任务接收到这次数据）
        if(wifi_send_user((uint8_t *)send_buf_p,strlen(send_buf_p),2,NULL))
        {
            LOG(LEVEL_INFO, "Send Fail\n");
            goto WIFI_SEND_FAIL;
        }
        
        OSTimeDly(1000);
        uint8_t message_recv_cnt = 0;
        uint32_t recv_tcp_ip = 0;
        while(1)
        {
            memset(recv_buf_p, 0, HTTP_BUF_MAX);
            recv_len=wifi_recv_user(recv_buf_p,HTTP_BUF_MAX,&recv_tcp_ip,NULL);
            if(inet_addr(TCP_IP) == recv_tcp_ip&& recv_len > 0)
            {
                //LOG(LEVEL_INFO, "wifi_Recv(%d):%s\n", recv_len, recv_buf_p);
                message_start_p = strstr((char *)recv_buf_p, "{\"instance\":\"");
                if(message_start_p!=NULL)
                {

                }else{
                    LOG(LEVEL_INFO,"wifi_recv FAIL\n");
                    goto WIFI_FILES_MESSAGE_FAIL;
                }

                memset(&message_app_info, 0, sizeof(message_app_info));
                    
                if(find_app_message(message_start_p, &message_app_info) != 0)
                {
                    LOG(LEVEL_INFO, "FILES_MESSAGE_FAIL!\n");
                    goto WIFI_FILES_MESSAGE_FAIL;
                }
                //LOG(LEVEL_INFO, "\n\n%s\n%s\n%s\n%s\n", 
                // message_app_info.instance_buf, 
                // message_app_info.time_buf,
                // message_app_info.file_buf, 
                // message_app_info.force_buf);

                memset(&message_resources_info, 0, sizeof(message_resources_info));
                message_start_p = strstr(message_start_p, "\n");
                if(message_start_p != NULL)
                {
                    message_start_p += 1;
                    //LOG(LEVEL_INFO, "\nRes Message: %s\n", message_start_p);
                }
                else
                {
                    goto WIFI_FILES_MESSAGE_FAIL;
                }

                if(find_resources_message(message_start_p, &message_resources_info) != 0)
                {
                    LOG(LEVEL_INFO, "Resource FILES_MESSAGE_FAIL!\n");
                    //goto WIFI_FILES_MESSAGE_FAIL;
                }
                else
                {
                    //LOG(LEVEL_INFO, "\n\n%s\n%s\n%s\n%s\n%d\n", 
                        // message_resources_info.path_buf, 
                        // message_resources_info.file_buf[0], 
                        // message_resources_info.file_buf[1], 
                        // message_resources_info.file_buf[2], 
                        // message_resources_info.files_cnt);
                }
               
                find_version();             //找到现在的版本号
                break;

            }else{
                OSTimeDly(1000);
                if(message_recv_cnt ++ > 5)
                {
                    LOG(LEVEL_INFO, "wifi Message no recv data.\n");
                    wifi_tcp_recving_sta = 0;       //TCP接收完成
                    goto WIFI_FILES_MESSAGE_FAIL;
                }

            }
        }
        wifi_tcp_recving_sta = 0;       //TCP接收完成
        if(loacl_version < atoi(message_app_info.soft_v_buf))
        {
            memset(send_buf_p, 0, HTTP_BUF_MAX); 
            strcpy(send_buf_p, URL_LIST[url_choose].url_1);
            strcpy(send_buf_p + strlen(send_buf_p), message_app_info.path_buf);
            strcpy(send_buf_p + strlen(send_buf_p), message_app_info.file_buf);
            strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_3);
            strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_4);
        
            uint32_t recv_cnt = 0;
            char *buf_temp_p;
            uint8_t recv_err_cnt = 0;

            wifi_connect_transparent(TCP_IP,URL_LIST[url_choose].port);          //设置透传模式 
            transparent_recv_old=transparent_rx_buf;
            transparent_recv_new=transparent_rx_buf;
            wifi_send_transparent((uint8_t *)send_buf_p, strlen(send_buf_p));

            while(1)
            {
                if(transparent_rx_buf_cnt-transparent_recv_old > 500)
                {
                    transparent_recv_new = transparent_recv_old+500;
                    recv_len = transparent_recv_new - transparent_recv_old;
                    memcpy(recv_buf_p,transparent_recv_old,recv_len);
                    transparent_recv_old = transparent_recv_new;

                    // LOG(LEVEL_INFO,"RX_APP:%s\n",recv_buf_p);
                    buf_temp_p = strstr(recv_buf_p, "\r\n\r\n");
                    recv_cnt += recv_len - (buf_temp_p - recv_buf_p + 4);			
                    buf_temp_p = strstr(recv_buf_p, "Content-Length: ");
                    if(buf_temp_p == NULL)
                    {
                        LOG(LEVEL_INFO, "File recv data err\n");
                        goto WIFI_APP_FILE_RECV_FAIL;
                    }
                    sscanf(buf_temp_p, "Content-Length: %d\r\n%*s", &(message_app_info.file_length));
                    LOG(LEVEL_INFO, "Need Recv Length:%d\n", message_app_info.file_length);  
                    save_file_buf_p = mymalloc(SRAMEX, message_app_info.file_length);
                    memcpy(save_file_buf_p, recv_buf_p + recv_len - recv_cnt, recv_cnt);
                    break;
                }else{
                    OSTimeDly(100);
                    if(recv_err_cnt++ > 50)
                    {
                        LOG(LEVEL_INFO, "File recv fail\n");
                        goto WIFI_APP_FILE_RECV_FAIL;
                    }
                }
            }

            recv_err_cnt = 0;
            while(1)
            {
                if(transparent_rx_buf_cnt<transparent_recv_old)
                {
                    transparent_recv_new = transparent_rx_buf_cnt;
                    recv_len = transparent_rx_buf_last - transparent_recv_old + 1;
                    memcpy(save_file_buf_p + recv_cnt, transparent_recv_old, recv_len);
                    recv_cnt += recv_len;

                    recv_len = transparent_recv_new-transparent_rx_buf;
                    memcpy(save_file_buf_p + recv_cnt, transparent_rx_buf, recv_len);
                    transparent_recv_old = transparent_recv_new;
                    recv_cnt += recv_len;
                    recv_err_cnt = 0;               //接收到数据重置

                }else if(transparent_rx_buf_cnt>transparent_recv_old){
                    transparent_recv_new = transparent_rx_buf_cnt;
                    recv_len = transparent_recv_new - transparent_recv_old;
                    memcpy(save_file_buf_p + recv_cnt, transparent_recv_old, recv_len);
                    transparent_recv_old = transparent_recv_new;
                    recv_cnt += recv_len;
                    recv_err_cnt = 0;               //接收到数据重置
                }
                if(recv_cnt >= message_app_info.file_length)
                {
                    LOG(LEVEL_INFO, "File recv success!\n");
                    break;
                }
                if(recv_err_cnt++ > 200)
                {
                    LOG(LEVEL_INFO, "File recv fail!\n");
                    goto WIFI_APP_FILE_RECV_FAIL;
                }
                OSTimeDly(10);
            }

