ronn-cn/SharkSmart/SharkSmart/bin/Debug/Library/Components/STM32F429IG-S/Project/Config/ETH/src/eth_upgrade.c
            if(strcmp(message_app_info.force_buf, "1") == 0)
            {
                if(1)
                if(recv_cnt == message_app_info.file_length)
                {
                    LOG(LEVEL_INFO, "ALL recv OK!\n");
                    add_app_upgrade_file(save_file_buf_p);           //app文件添加
                }
                
            }
            OSTimeDly(1000);
        }    
WIFI_APP_FILE_RECV_FAIL:
        OSTimeDly(1000);


/*********************************************resource**********************************************/
        uint8_t resources_file_cnt = message_resources_info.files_cnt;
        if(resources_file_cnt>0)
        {
            wifi_connect_transparent(TCP_IP,URL_LIST[url_choose].port);       //设置透传模式
        }
        
        while(resources_file_cnt > 0)
        {
            memset(send_buf_p, 0, HTTP_BUF_MAX);
            strcpy(send_buf_p, URL_LIST[url_choose].url_1);
            strcpy(send_buf_p + strlen(send_buf_p), message_resources_info.path_buf);
            strcpy(send_buf_p + strlen(send_buf_p), message_resources_info.file_buf[resources_file_cnt - 1]);
            strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_3);
            strcpy(send_buf_p + strlen(send_buf_p), URL_LIST[url_choose].url_4);
            LOG(LEVEL_INFO, "URL:%s\n", send_buf_p);

            transparent_rx_buf_cnt=transparent_rx_buf;
            transparent_recv_old=transparent_rx_buf;
            transparent_recv_new=transparent_rx_buf;
            wifi_send_transparent((uint8_t *)send_buf_p, strlen(send_buf_p));
            
            uint32_t recv_cnt = 0;
            char *buf_temp_p;
            uint8_t recv_err_cnt = 0;
            while(1)
            {
                if(transparent_rx_buf_cnt-transparent_recv_old > 500)
                {
                    transparent_recv_new = transparent_recv_old+500;
                    recv_len = transparent_recv_new - transparent_recv_old;
                    memcpy(recv_buf_p,transparent_recv_old,recv_len);
                    transparent_recv_old = transparent_recv_new;

                    // LOG(LEVEL_INFO,"rx_resource:%s\n",recv_buf_p);
                    buf_temp_p = strstr(recv_buf_p, "\r\n\r\n");
                    recv_cnt += recv_len - (buf_temp_p - recv_buf_p + 4);
                    buf_temp_p = strstr(recv_buf_p, "Content-Length: ");
                    if(buf_temp_p == NULL)
                    {
                        LOG(LEVEL_INFO, "File recv data err\n");
                        goto WIFI_RES_FILE_RECV_FAIL;
                    }
                    sscanf(buf_temp_p, "Content-Length: %d\r\n%*s", &(message_resources_info.file_length[resources_file_cnt - 1]));
                    LOG(LEVEL_INFO, "Need Recv Length:%d\n", message_resources_info.file_length[resources_file_cnt - 1]);
                    message_resources_info.save_buf_p[resources_file_cnt - 1] = mymalloc(SRAMEX, message_resources_info.file_length[resources_file_cnt - 1]);
                    memcpy(message_resources_info.save_buf_p[resources_file_cnt - 1], recv_buf_p + recv_len - recv_cnt, recv_cnt);
                    break;
                }else{
                    OSTimeDly(100);
                    if(recv_err_cnt++ > 50)
                    {
                        LOG(LEVEL_INFO, "File recv fail\n");
                        goto WIFI_RES_FILE_RECV_FAIL;
                    }
                }
            }
            
            recv_err_cnt = 0;
            while(1)
            {
                if(transparent_rx_buf_cnt<transparent_recv_old)
                {
                    transparent_recv_new = transparent_rx_buf_cnt;
                    recv_len = transparent_rx_buf_last - transparent_recv_old + 1;
                    memcpy(message_resources_info.save_buf_p[resources_file_cnt - 1] + recv_cnt, transparent_recv_old, recv_len);
                    recv_cnt += recv_len;

                    recv_len = transparent_recv_new-transparent_rx_buf;
                    memcpy(message_resources_info.save_buf_p[resources_file_cnt - 1] + recv_cnt, transparent_rx_buf, recv_len);
                    transparent_recv_old = transparent_recv_new;
                    recv_cnt += recv_len;
                    recv_err_cnt = 0;               //接收到数据重置

                }else if(transparent_rx_buf_cnt>transparent_recv_old){
                    transparent_recv_new = transparent_rx_buf_cnt;
                    recv_len = transparent_recv_new - transparent_recv_old;
                    memcpy(message_resources_info.save_buf_p[resources_file_cnt - 1] + recv_cnt, transparent_recv_old, recv_len);
                    transparent_recv_old = transparent_recv_new;
                    recv_cnt += recv_len;
                    recv_err_cnt = 0;               //接收到数据重置
                }
                if(recv_cnt >= message_resources_info.file_length[resources_file_cnt - 1])
                {
                    LOG(LEVEL_INFO, "File recv success!\n");
                    break;
                }
                if(recv_err_cnt++ > 200)
                {
                    //LOG(LEVEL_INFO, "File recv %d\n", recv_cnt);
                    LOG(LEVEL_INFO, "File recv fail!\n");
                    goto WIFI_RES_FILE_RECV_FAIL;
                }
                OSTimeDly(10);
            }
           
            if(1)
            {
                if(1)
                if(recv_cnt == message_resources_info.file_length[resources_file_cnt - 1])
                {
                    LOG(LEVEL_INFO, "resource_%d:ALL recv OK!\n",resources_file_cnt-1);
                    add_resource_file(resources_file_cnt);        //添加缺少的资源文件
                }
                
            }
            resources_file_cnt--;
        }
        
WIFI_RES_FILE_RECV_FAIL:
        OSTimeDly(1000);

        if(wifi_disconnect_transparent())    //关闭透传模式(必须成功)
        {
            goto  WIFI_RES_FILE_RECV_FAIL;
        }
           
        myfree(SRAMEX, save_file_buf_p);

        myfree(SRAMEX, message_resources_info.save_buf_p[0]);
        myfree(SRAMEX, message_resources_info.save_buf_p[1]);
        myfree(SRAMEX, message_resources_info.save_buf_p[2]);
        myfree(SRAMEX, message_resources_info.save_buf_p[3]);
        myfree(SRAMEX, message_resources_info.save_buf_p[4]);
        myfree(SRAMEX, message_resources_info.save_buf_p[5]);
        myfree(SRAMEX, message_resources_info.save_buf_p[6]);
        myfree(SRAMEX, message_resources_info.save_buf_p[7]);
        myfree(SRAMEX, message_resources_info.save_buf_p[8]);
        myfree(SRAMEX, message_resources_info.save_buf_p[9]);

        if(strcmp(message_app_info.force_buf, "1") == 0 
           ||strcmp(message_resources_info.reboot_buf, "1") == 0)
            {
                if(message_resources_info.recv_ok_flag == 1  
                    ||message_app_info.recv_ok_flag == 1)
                    {
                        LOG(LEVEL_INFO, "System restart!\n");
                        HAL_NVIC_SystemReset();
                    }

            }

        OSTimeDly(30000);
    
WIFI_FILES_MESSAGE_FAIL:
        OSTimeDly(100000);
WIFI_SEND_FAIL:
        OSTimeDly(2000);
    }

}


void eth_upgrade_creat(void)
{
    uint32_t  cpu_sr;
    OS_ENTER_CRITICAL();

    LWIP_UPGRADE_TASK_STK = mymalloc(SRAMEX, LWIP_UPGRADE_STK_SIZE* 4);
	OSTaskCreate(lwip_upgarde_thread, \
				"lwip_upgrade", \
				NULL, \
				(uint32_t*)&LWIP_UPGRADE_TASK_STK[LWIP_UPGRADE_STK_SIZE-1], \
				LWIP_UPGRADE_PRIO);

    WIFI_TASK_UPDATE_STK = mymalloc(SRAMEX, WIFI_STK_UPDATE_SIZE* 4);
    OSTaskCreate(wifi_update_task, \
                 "wifi_update_task", \
                  NULL, \
                  (uint32_t *)&WIFI_TASK_UPDATE_STK[WIFI_STK_UPDATE_SIZE - 1], \
                  WIFI_TASK_UPDATE_PRIO);

    OSTaskSuspend(LWIP_UPGRADE_PRIO);
    OSTaskSuspend(WIFI_TASK_UPDATE_PRIO);

    OS_EXIT_CRITICAL();
}
